01  WS-DATA-AREA. 
    05 WS-NUMBER PIC 9(5) VALUE 10000. 
    05 WS-NUMBER2 PIC 9(5) VALUE 50000. 
    05 WS-NUMBER3 PIC 9(10). 

    ADD WS-NUMBER WS-NUMBER2 GIVING WS-NUMBER3. 

    DISPLAY "Result: " WS-NUMBER3.
STOP RUN.